/* Задача 41: Пользователь вводит с клавиатуры M чисел. Посчитайте, сколько чисел больше 0 ввёл пользователь.

0, 7, 8, -2, -2 -> 2

1, -7, 567, 89, 223-> 3 */

// Console.Write("Введите число M: ");
// int m = int.Parse(Console.ReadLine()!);
// int[] array = new int[m];

// int CountPol(int[] size)
// {
//     int count = 0;
//     foreach( int el in array)
//     {
//         if(el > 0) count ++;
//     }
//     return count;
// }

// CountPol(array);
// Console.WriteLine(String.Join(", ", array));
// Console.WriteLine($"{CountPol(array)}");


